UweBonnes/ethernut/nut/include/arch/cm3/stm/generated/stm32g081_dma.h
/* Do not edit! Generated automatically from /evo860/opt/stm/STM32CubeMX/db/mcu/IP//DMA-STM32G081_dma1_v1_3_Modes.xml.*/

#if !defined(_STM32G081_DMA_H_)
# define _STM32G081_DMA_H_

#define STM32_DMA_VERSION 13

#define DMA_ADC1           {{DMA_ANY, DMA_REQUEST_ADC1}, {}}
#define DMA_AES_IN         {{DMA_ANY, DMA_REQUEST_AES_IN}, {}}
#define DMA_AES_OUT        {{DMA_ANY, DMA_REQUEST_AES_OUT}, {}}
#define DMA_DAC1_CH1       {{DMA_ANY, DMA_REQUEST_DAC1_CH1}, {}}
#define DMA_DAC1_CH2       {{DMA_ANY, DMA_REQUEST_DAC1_CH2}, {}}
#define DMA_DMA_GENERATOR0 {{DMA_ANY, DMA_REQUEST_DMA_GENERATOR0}, {}}
#define DMA_DMA_GENERATOR1 {{DMA_ANY, DMA_REQUEST_DMA_GENERATOR1}, {}}
#define DMA_DMA_GENERATOR2 {{DMA_ANY, DMA_REQUEST_DMA_GENERATOR2}, {}}
#define DMA_DMA_GENERATOR3 {{DMA_ANY, DMA_REQUEST_DMA_GENERATOR3}, {}}
#define DMA_I2C1_RX        {{DMA_ANY, DMA_REQUEST_I2C1_RX}, {}}
#define DMA_I2C1_TX        {{DMA_ANY, DMA_REQUEST_I2C1_TX}, {}}
#define DMA_I2C2_RX        {{DMA_ANY, DMA_REQUEST_I2C2_RX}, {}}
#define DMA_I2C2_TX        {{DMA_ANY, DMA_REQUEST_I2C2_TX}, {}}
#define DMA_LPUART1_RX     {{DMA_ANY, DMA_REQUEST_LPUART1_RX}, {}}
#define DMA_LPUART1_TX     {{DMA_ANY, DMA_REQUEST_LPUART1_TX}, {}}
#define DMA_SPI1_RX        {{DMA_ANY, DMA_REQUEST_SPI1_RX}, {}}
#define DMA_SPI1_TX        {{DMA_ANY, DMA_REQUEST_SPI1_TX}, {}}
#define DMA_SPI2_RX        {{DMA_ANY, DMA_REQUEST_SPI2_RX}, {}}
#define DMA_SPI2_TX        {{DMA_ANY, DMA_REQUEST_SPI2_TX}, {}}
#define DMA_TIM15_CH1      {{DMA_ANY, DMA_REQUEST_TIM15_CH1}, {}}
#define DMA_TIM15_CH2      {{DMA_ANY, DMA_REQUEST_TIM15_CH2}, {}}
#define DMA_TIM15_TRIG_COM {{DMA_ANY, DMA_REQUEST_TIM15_TRIG_COM}, {}}
#define DMA_TIM15_UP       {{DMA_ANY, DMA_REQUEST_TIM15_UP}, {}}
#define DMA_TIM16_CH1      {{DMA_ANY, DMA_REQUEST_TIM16_CH1}, {}}
#define DMA_TIM16_TRIG_COM {{DMA_ANY, DMA_REQUEST_TIM16_TRIG_COM}, {}}
#define DMA_TIM16_UP       {{DMA_ANY, DMA_REQUEST_TIM16_UP}, {}}
#define DMA_TIM17_CH1      {{DMA_ANY, DMA_REQUEST_TIM17_CH1}, {}}
#define DMA_TIM17_TRIG_COM {{DMA_ANY, DMA_REQUEST_TIM17_TRIG_COM}, {}}
#define DMA_TIM17_UP       {{DMA_ANY, DMA_REQUEST_TIM17_UP}, {}}
#define DMA_TIM1_CH1       {{DMA_ANY, DMA_REQUEST_TIM1_CH1}, {}}
#define DMA_TIM1_CH2       {{DMA_ANY, DMA_REQUEST_TIM1_CH2}, {}}
#define DMA_TIM1_CH3       {{DMA_ANY, DMA_REQUEST_TIM1_CH3}, {}}
#define DMA_TIM1_CH4       {{DMA_ANY, DMA_REQUEST_TIM1_CH4}, {}}
#define DMA_TIM1_TRIG_COM  {{DMA_ANY, DMA_REQUEST_TIM1_TRIG_COM}, {}}
#define DMA_TIM1_UP        {{DMA_ANY, DMA_REQUEST_TIM1_UP}, {}}
#define DMA_TIM2_CH1       {{DMA_ANY, DMA_REQUEST_TIM2_CH1}, {}}
#define DMA_TIM2_CH2       {{DMA_ANY, DMA_REQUEST_TIM2_CH2}, {}}
#define DMA_TIM2_CH3       {{DMA_ANY, DMA_REQUEST_TIM2_CH3}, {}}
#define DMA_TIM2_CH4       {{DMA_ANY, DMA_REQUEST_TIM2_CH4}, {}}
#define DMA_TIM2_TRIG      {{DMA_ANY, DMA_REQUEST_TIM2_TRIG}, {}}
#define DMA_TIM2_UP        {{DMA_ANY, DMA_REQUEST_TIM2_UP}, {}}
#define DMA_TIM3_CH1       {{DMA_ANY, DMA_REQUEST_TIM3_CH1}, {}}
#define DMA_TIM3_CH2       {{DMA_ANY, DMA_REQUEST_TIM3_CH2}, {}}
#define DMA_TIM3_CH3       {{DMA_ANY, DMA_REQUEST_TIM3_CH3}, {}}
#define DMA_TIM3_CH4       {{DMA_ANY, DMA_REQUEST_TIM3_CH4}, {}}
#define DMA_TIM3_TRIG      {{DMA_ANY, DMA_REQUEST_TIM3_TRIG}, {}}
#define DMA_TIM3_UP        {{DMA_ANY, DMA_REQUEST_TIM3_UP}, {}}
#define DMA_TIM6_UP        {{DMA_ANY, DMA_REQUEST_TIM6_UP}, {}}
#define DMA_TIM7_UP        {{DMA_ANY, DMA_REQUEST_TIM7_UP}, {}}
#define DMA_UCPD1_RX       {{DMA_ANY, DMA_REQUEST_UCPD1_RX}, {}}
#define DMA_UCPD1_TX       {{DMA_ANY, DMA_REQUEST_UCPD1_TX}, {}}
#define DMA_UCPD2_RX       {{DMA_ANY, DMA_REQUEST_UCPD2_RX}, {}}
#define DMA_UCPD2_TX       {{DMA_ANY, DMA_REQUEST_UCPD2_TX}, {}}
#define DMA_USART1_RX      {{DMA_ANY, DMA_REQUEST_USART1_RX}, {}}
#define DMA_UART1_RX    DMA_USART1_RX
#define DMA_USART1_TX      {{DMA_ANY, DMA_REQUEST_USART1_TX}, {}}
#define DMA_UART1_TX    DMA_USART1_TX
#define DMA_USART2_RX      {{DMA_ANY, DMA_REQUEST_USART2_RX}, {}}
#define DMA_UART2_RX    DMA_USART2_RX
#define DMA_USART2_TX      {{DMA_ANY, DMA_REQUEST_USART2_TX}, {}}
#define DMA_UART2_TX    DMA_USART2_TX
#define DMA_USART3_RX      {{DMA_ANY, DMA_REQUEST_USART3_RX}, {}}
#define DMA_UART3_RX    DMA_USART3_RX
#define DMA_USART3_TX      {{DMA_ANY, DMA_REQUEST_USART3_TX}, {}}
#define DMA_UART3_TX    DMA_USART3_TX
#define DMA_USART4_RX      {{DMA_ANY, DMA_REQUEST_USART4_RX}, {}}
#define DMA_UART4_RX    DMA_USART4_RX
#define DMA_USART4_TX      {{DMA_ANY, DMA_REQUEST_USART4_TX}}
#define DMA_UART4_TX    DMA_USART4_TX

#endif
